In [126]:
import pandas as pd

    Series
A Series is an one dimensional array like object containing a sequence of values and an index.

In [127]:
data = [1, 2, 3, 4]

In [128]:
s1 = pd.Series(data)

In [129]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [130]:
# to print values in a series
s1.values

array([1, 2, 3, 4], dtype=int64)

In [131]:
# to print the index
s1.index

RangeIndex(start=0, stop=4, step=1)

In [132]:
# labelling the index to the values
s1.index = ['a', 'b', 'c', 'd']

In [133]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [134]:
# index has changed
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [135]:
# we can acess values in a series by index 0 and index 'a'
s1[0], s1['a']

(1, 1)

iloc queries by position and loc queries by label name

In [136]:
s1.iloc[0], s1.loc['a']

(1, 1)

In [137]:
s1.loc

In [138]:
# checking if value is present in series
1 in s1.values

True

In [139]:
# checking if index is present in series
# not working
'b' in s1.values

<ipython-input-139-51d9a8d92548>:3: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  'b' in s1.values

False

In [140]:
# selection particular part of values
s1[1:4]

b    2
c    3
d    4
dtype: int64

In [141]:
data2 = {'Jaipur' : 'Rajasthan',
       'Mumbai' : 'Maharashtra',
       'Kolkata' : 'West Bengal',
       'Bangaluru' : 'Karnataka',
       'Chandigarh' : 'Punjab'}

In [142]:
s2 = pd.Series(data2)

In [143]:
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bangaluru       Karnataka
Chandigarh         Punjab
dtype: object

In [144]:
s2.index

Index(['Jaipur', 'Mumbai', 'Kolkata', 'Bangaluru', 'Chandigarh'], dtype='object')

In [145]:
s2.values

array(['Rajasthan', 'Maharashtra', 'West Bengal', 'Karnataka', 'Punjab'],
      dtype=object)

In [146]:
# assigning names for index column
s2.name='states'
s2.index.name='capital'
# dats.values.name='states'

In [147]:
s2

capital
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bangaluru       Karnataka
Chandigarh         Punjab
Name: states, dtype: object

In [148]:
s2[['Jaipur', 'Mumbai', 'Kolkata']]

capital
Jaipur       Rajasthan
Mumbai     Maharashtra
Kolkata    West Bengal
Name: states, dtype: object

In [149]:
# matches the index from capitals  and match it to the datav set and for remaining it sets to NaN
capitals=['Jaipur', 'Mumbai', 'Delhi']
s3 = pd.Series(s2, index=capitals)

In [150]:
s3

Jaipur      Rajasthan
Mumbai    Maharashtra
Delhi             NaN
Name: states, dtype: object

In [151]:
# cheking for the null value
s3.isnull()

Jaipur    False
Mumbai    False
Delhi      True
Name: states, dtype: bool

In [152]:
# checking for not null value
s3.notnull()

Jaipur     True
Mumbai     True
Delhi     False
Name: states, dtype: bool

In [153]:
# index lables can be non unique
s = pd.Series(['india', 'australia', 'england'], index=['cricket', 'cricket', 'cricket'])

In [154]:
s

cricket        india
cricket    australia
cricket      england
dtype: object

In [155]:
s.loc['cricket']

cricket        india
cricket    australia
cricket      england
dtype: object

    DataFrame
A DataFrame represents a rectangular table of data and contains a collection of columns. The DataFrame has both a row and column index.

In [156]:
student1 = pd.Series({'Name' : 'Utkarsh',
                     'Id' : 1})
student2 = pd.Series({'Name' : 'Amit',
                     'Id' : 2})
student3 = pd.Series({'Name' : 'Ankit',
                     'Id' : 3})

In [157]:
(student1)

Name    Utkarsh
Id            1
dtype: object

In [158]:
# dataframe with index
df = pd.DataFrame([student1, student2, student3], index=[101, 102, 103])

In [159]:
df

        Name  Id
101  Utkarsh   1
102     Amit   2
103    Ankit   3

In [160]:
stud_data = {
    'Name':['Lokesh' , 'madhu', 'anu'],
    'ID':[1, 2, 3]
}

In [161]:
dfs = pd.DataFrame(stud_data)

In [162]:
dfs

     Name  ID
0  Lokesh   1
1   madhu   2
2     anu   3

In [163]:
# dataframe with index and columns
df3 = pd.DataFrame(stud_data, index=[101, 102, 103], columns=['Name','ID', 'Age'])

In [164]:
df3

       Name  ID  Age
101  Lokesh   1  NaN
102   madhu   2  NaN
103     anu   3  NaN

In [165]:
# assign a value to the df
df3['Age'].loc[102]=15

C:\Users\lokes\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [166]:
df3.index

Int64Index([101, 102, 103], dtype='int64')

In [167]:
df3.values

array([['Lokesh', 1, nan],
       ['madhu', 2, 15],
       ['anu', 3, nan]], dtype=object)

In [168]:
df3.columns

Index(['Name', 'ID', 'Age'], dtype='object')

In [169]:
df3.loc[103] = ['Ressh', 5, 20]
df3.loc[104] = ['Anu', 4, 16]

In [170]:
df3

       Name  ID  Age
101  Lokesh   1  NaN
102   madhu   2   15
103   Ressh   5   20
104     Anu   4   16

In [171]:
# adding one more column from a series
st = pd.Series(['ctr','tpt', 'vlr', 'pon'], index=[101, 102, 103, 105])

In [172]:
df3['place'] = st

In [173]:
df3

       Name  ID  Age place
101  Lokesh   1  NaN   ctr
102   madhu   2   15   tpt
103   Ressh   5   20   vlr
104     Anu   4   16   NaN

In [174]:
# adding one more column but with values to limited no of ID's
ht = pd.Series([160, 100], index=[101, 103])

In [175]:
df3['Height'] = ht

In [176]:
df3

       Name  ID  Age place  Height
101  Lokesh   1  NaN   ctr   160.0
102   madhu   2   15   tpt     NaN
103   Ressh   5   20   vlr   100.0
104     Anu   4   16   NaN     NaN

In [186]:
# copying same values to other column
df3['weight'] = df3.Age

In [187]:
df3

       Name  ID  Age place  Height weight
101  Lokesh   1  NaN   ctr   160.0    NaN
102   madhu   2   15   tpt     NaN     15
103   Ressh   5   20   vlr   100.0     20
104     Anu   4   16   NaN     NaN     16

In [188]:
# check for null values
df3['place'].notnull()

101     True
102     True
103     True
104    False
Name: place, dtype: bool

In [189]:
df3.drop([104,102])

       Name  ID  Age place  Height weight
101  Lokesh   1  NaN   ctr   160.0    NaN
103   Ressh   5   20   vlr   100.0     20

In [195]:
# df3.reset_index(inplace=True)

In [200]:
df3

details       Name  ID  Age place  Height
studentsID
101         Lokesh   1  NaN   ctr   160.0
102          madhu   2   15   tpt     NaN
103          Ressh   5   20   vlr   100.0
104            Anu   4   16   NaN     NaN

In [192]:
# delete particular column
del df3['weight']

In [199]:
df3.index.name='studentsID'
df3.columns.name='details'

In [202]:
#index objects are immutable
#index can also have duplicate items
df4=df3.reindex([102, 202, 103, 204, 205, 206])

In [203]:
df4

details      Name   ID  Age place  Height
studentsID
102         madhu  2.0   15   tpt     NaN
202           NaN  NaN  NaN   NaN     NaN
103         Ressh  5.0   20   vlr   100.0
204           NaN  NaN  NaN   NaN     NaN
205           NaN  NaN  NaN   NaN     NaN
206           NaN  NaN  NaN   NaN     NaN

In [229]:
df5=df3.reindex([102, 202, 103, 204, 205, 206], method='ffill')

In [230]:
df5

details      Name  ID Age place  Height
studentsID
102         madhu   2  15   tpt     NaN
202           Anu   4  16   NaN     NaN
103         Ressh   5  20   vlr   100.0
204           Anu   4  16   NaN     NaN
205           Anu   4  16   NaN     NaN
206           Anu   4  16   NaN     NaN

In [220]:
df5.dropna(inplace=True) # drops all null values and retains only not null records and also changes in the original df

In [224]:
df5.fillna(0) # fills empty values with 0

details      Name  ID  Age place  Height
studentsID
102         madhu   2   15   tpt     0.0
202           Anu   4   16     0     0.0
103         Ressh   5   20   vlr   100.0
204           Anu   4   16     0     0.0
205           Anu   4   16     0     0.0
206           Anu   4   16     0     0.0

In [244]:
df5.set_index(['studentsID'])

details      Name  ID Age place  Height
studentsID
102         madhu   2  15   tpt     NaN
202           Anu   4  16   NaN     NaN
103         Ressh   5  20   vlr   100.0
204           Anu   4  16   NaN     NaN
205           Anu   4  16   NaN     NaN
206           Anu   4  16   NaN     NaN

In [241]:
df5.reset_index(inplace=True)

In [242]:
df5.columns

Index(['studentsID', 'Name', 'ID', 'Age', 'place', 'Height'], dtype='object', name='details')

In [243]:
df5

details  studentsID   Name  ID Age place  Height
0               102  madhu   2  15   tpt     NaN
1               202    Anu   4  16   NaN     NaN
2               103  Ressh   5  20   vlr   100.0
3               204    Anu   4  16   NaN     NaN
4               205    Anu   4  16   NaN     NaN
5               206    Anu   4  16   NaN     NaN

indexing and sorting a dataframe

In [267]:
# selecting only particular columns in the index range
df3.loc[:, ['Name', 'ID']]

details       Name  ID
studentsID
101         Lokesh   1
102          madhu   2
103          Ressh   5
104            Anu   4

In [269]:
df3.loc[104]['Name']

'Anu'

In [271]:
df3.iloc[0]

details
Name      Lokesh
ID             1
Age          NaN
place        ctr
Height       160
Name: 101, dtype: object

In [275]:
df3

details       Name  ID  Age place  Height
studentsID
101         Lokesh   1  NaN   ctr   160.0
102          madhu   2   15   tpt     NaN
103          Ressh   5   20   vlr   100.0
104            Anu   4   16   NaN     NaN

In [284]:
# here we are accessig the df by index value
# [0,1] -- represents index
# [1, 3] -- represents columns
df3.iloc[[0,1],[1,3]]

details     ID place
studentsID
101          1   ctr
102          2   tpt

In [285]:
# sort index -- sorts by default with index values
df3.sort_index()

details       Name  ID  Age place  Height
studentsID
101         Lokesh   1  NaN   ctr   160.0
102          madhu   2   15   tpt     NaN
103          Ressh   5   20   vlr   100.0
104            Anu   4   16   NaN     NaN

In [291]:
# sorts by values provided in the by= arg
df6=df3.sort_values(by='Name')

In [292]:
df6

details       Name  ID  Age place  Height
studentsID
104            Anu   4   16   NaN     NaN
101         Lokesh   1  NaN   ctr   160.0
103          Ressh   5   20   vlr   100.0
102          madhu   2   15   tpt     NaN

In [293]:
df6.sort_index()

details       Name  ID  Age place  Height
studentsID
101         Lokesh   1  NaN   ctr   160.0
102          madhu   2   15   tpt     NaN
103          Ressh   5   20   vlr   100.0
104            Anu   4   16   NaN     NaN

In [297]:
df6.sort_index(axis=1, ascending=True) # sorts the columns

details     Age  Height  ID    Name place
studentsID
104          16     NaN   4     Anu   NaN
101         NaN   160.0   1  Lokesh   ctr
103          20   100.0   5   Ressh   vlr
102          15     NaN   2   madhu   tpt

     #axis=0 --> for index level
     #axis=1 --> for column level

In [299]:
# sorts the index --> default case
df6.sort_index(axis=0, ascending=True)

details       Name  ID  Age place  Height
studentsID
101         Lokesh   1  NaN   ctr   160.0
102          madhu   2   15   tpt     NaN
103          Ressh   5   20   vlr   100.0
104            Anu   4   16   NaN     NaN

In [302]:
df6['Name'].unique()

array(['Anu', 'Lokesh', 'Ressh', 'madhu'], dtype=object)

In [304]:
df6.loc[105]=df6.loc[104]

In [311]:
type(df6['Name'].unique())

numpy.ndarray